In [19]:
import pandas as pd
from sqlalchemy import create_engine

In [24]:
connection_str='mysql+pymysql://root:fusion2010@localhost/escuelita'
#Oracle:
#connection_oracle='oracleoci:///?User=myUser;Password=myPassword&Server=localhost&Port=1521'

In [21]:
connection=create_engine(connection_str)

In [22]:
dataFrame=pd.read_sql("SELECT * FROM alumno",con=connection)

In [25]:
dataFrame

   id   nombre
0   1  Juanito
1   2    Maria
2   3    Pedro
3   4   Camila
4   5    Jesus
5   6   Ramiro

In [29]:
conn_str='sqlite:///C:/SQLite/sqlite-tools-win32-x86-3430000/escuelita.db'

In [30]:
connection_sqlite=create_engine(conn_str)

In [31]:
data=pd.read_sql('SELECT * FROM alumno',connection_sqlite)

In [32]:
data

   id     nombre
0   1    Juanito
1   2      Maria
2   3      Pedro
3   4     Camila
4   5      Jesus
5   6     Donald
6   7  Gertrudis